package menu;
/*
 * 
 * 
 * 纯描述类
 */
public class magicDiscription {

	static String[][] zhang=new String[5][2];
	static String[][] lu=new String[5][2];
	static String[][] yu=new String[5][2];
	
	public  magicDiscription(){
		zhang[0][0]="单体攻击，消耗灵力70点";
		zhang[0][1]="";
		zhang[1][0]="单体攻击，消耗灵力120点";
		zhang[1][1]="敌方体力下降两回合";
		zhang[2][0]="单体攻击，消耗灵力150点";
		zhang[2][1]="我方武力上升两回合";
		zhang[3][0]="群体攻击，消耗灵力160点";
		zhang[3][1]="";
		zhang[4][0]="群体攻击，消耗灵力200点";
		zhang[4][1]="软件堂武艺的最终奥义，力量强大";
		
		
		lu[0][0]="辅助技能，消耗灵力120点";
		lu[0][1]="我方敏捷上升两回合";
		lu[1][0]="辅助技能，消耗灵力达60%。我方进入攻击态";
		lu[1][1]="敌方进入等待态并可能敏捷下降";
		lu[2][0]="群体攻击，消耗灵力150点";
		lu[2][1]="80%概率敌方附上中毒状态两回合";
		lu[3][0]="单体加辅助技能，消耗灵力160点";
		lu[3][1]="使敌方附上麻痹状态两回合，无法攻击";
		lu[4][0]="群体加辅助攻击，消耗灵力200点";
		lu[4][1]="我方附上增益状态，敌方附上有害状态";
		
		yu[0][0]="单体攻击，消耗灵力70点";
		yu[0][1]="敌方80%附上中毒状态两回合";
		yu[1][0]="单体攻击，消耗灵力120点";
		yu[1][1]="自身敏捷上升两回合";
		yu[2][0]="群体攻击，消耗灵力150点";
		yu[2][1]="";
		yu[3][0]="群体恢复技能，消耗灵力160点，回复";
		yu[3][1]="生命值的40%，且使濒临死亡的人复活";
		yu[4][0]="单体攻击，消耗灵力200点";
		yu[4][1]="使用者同时武力上升三回合";
				
						
	}
	
}
